# ZoomType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PrintParameters..::..ZoomType Property
PrintParameters Class See Also
---
The zoom type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ZoomType ZoomType { get; set; }
```

Visual Basic
---
```text
Public Property ZoomType As ZoomType
	Get
	Set
```

Visual C++
---
```text
public:
property ZoomType ZoomType {
	ZoomType get ();
	void set (ZoomType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | Thrown when the input argument is out of range. |

# See Also
PrintParameters Class
Autodesk.Revit.DB Namespace